Revit 2024 API
ContentNode Class
 This class represents a generic content node in a model-exporting process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ContentNode : RenderNode
Visual Basic
Public Class ContentNode _
	Inherits RenderNode
Visual C++
public ref class ContentNode : public RenderNode
Remarks
 Members of this class implement properties and methods common to all content classes, such as RPC and Light nodes. Attributes of a content note can be accessed via an Asset object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.LightNode
 Autodesk.Revit.DB.RPCNode
See Also
ContentNode Members
Autodesk.Revit.DB Namespace